流氓做法将递归式改为for循环/流氓做法将递归式改为for循环.org
#+TITLE: 递归、尾递归、非递归
#+AUTHOR: wyj
#+EMAIL: rs@whu.edu.cn
#+KEYWORDS: 算法, notes
#+OPTIONS: H:2 toc:t ^:{}
#+STYLE: <link rel="stylesheet" type="text/css" href="./style/style.css" />
* 流氓做法直接将递归式改为for循环
** 步骤
1. 将函数表示为result，边界条件的返回值就是result的初值
2. 边界条件稍作改动成为for循环的判断条件
3. 界函数作为for循环的变量改变部分
4. 循环体内就是递归式
5. 返回result
** 例子1
#+begin_src C
int f_recursive(int m, int n)
{
    if (m == 0 && n >= 0) 
	return 0;
    return (f_recursive(m - 1, 2*n) + n);
}
#+end_src
#+begin_src C
int f_no_recursive(int m, int n)
{
    int result = 0;
    for (; m != 0 && n >= 0; --m, n *= 2)
    {
	result += n;
    }
    return result;
}
#+end_src
** 例子2
#+begin_src C
int f_recursive(int n)
{
    if (n == 0) 
	return 1;
    return (n * f_recursive(n/2));
}
#+end_src
#+begin_src C
int f_no_recursive(int n)
{
    int result = 1;
    for (; n != 0; n /= 2)
    {
	result *= n;
    }
    return result;
}
#+end_src

** 例子3  
#+begin_src C
int factorial_recursive(int n)
{
    if (n == 0)    //边界条件
    {
	return 1;
    }
    return factorial_recursive(n-1/*界函数*/) * n;    //f*n是递归式
}
#+end_src
#+begin_src C
int factorial_no_recursive(int n)
{
    int result = 1;
    for (; n != 0; --n)
    {
	result *= n;
    }
    return result;
}
#+end_src
* 递归转尾递归转循环
** 步骤
** 例子 
*** Factorial
#+begin_src C
int factorial_recursive(int n)
{
    if (n == 0)    //边界条件
    {
	return 1;
    }
    return factorial_recursive(n-1/*界函数*/) * n;    //f*n是递归式
}
#+end_src

#+begin_src C
int factorial_tail_recursive(int n, int acc)    //用acc表示f的返回结果
{
    if (n == 0)
    {
	return acc;
    }
    return factorial_tail_recursive(n-1/*界函数*/, acc*n);    //acc*n 递归式
}
#+end_src

#+begin_src C
int factorial_loop(int n, int acc)
{
    while (true)
    {
	if (n == 0)
	{
	    return acc;
	}
	acc *= n;
	--n;
    }
}
#+end_src

*** Fibonacci
#+begin_src C
int fibonacci_recursive(int n)
{
    if (n < 2)    //递归出口
    {
	return n;
    }
    return fibonacci_recursive(n-1) + fibonacci_recursive(n-2);
}
#+end_src

#+begin_src C
int fibonacci_tail_recursive(int n, int acc1, int acc2)
{
    if (n == 0)
    {
	return acc1;
    }
    return fibonacci_tail_recursive(n-1, acc2, acc1+acc2);
}
#+end_src

#+begin_src C
int fibonacci_loop(int n, int acc1, int acc2)
{
    while (true)
    {
	if (n == 0)
	{
	    return acc1;
	}
	int temp = acc1;
	acc1 = acc2;
	acc2 = temp + acc2;
	--n;
    }
}
#+end_src
* 二叉树非递归遍历
** 参考内容
*** http://www.cnblogs.com/dolphin0520/archive/2011/08/25/2153720.html
