流氓做法将递归式改为for循环/流氓做法将递归式改为for循环.html
<?xml version="1.0" encoding="gbk"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>递归、尾递归、非递归</title>
<meta http-equiv="Content-Type" content="text/html;charset=gbk"/>
<meta name="title" content="递归、尾递归、非递归"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-09-21 08:48:49 中国标准时间"/>
<meta name="author" content="wyj"/>
<meta name="description" content=""/>
<meta name="keywords" content="算法, notes"/>

<link rel="stylesheet" type="text/css" href="./style/style.css" />


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">递归、尾递归、非递归</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 流氓做法直接将递归式改为for循环</a>
<ul>
<li><a href="#sec-1-1">1.1 步骤</a></li>
<li><a href="#sec-1-2">1.2 例子1</a></li>
<li><a href="#sec-1-3">1.3 例子2</a></li>
<li><a href="#sec-1-4">1.4 例子3</a></li>
</ul>
</li>
<li><a href="#sec-2">2 递归转尾递归转循环</a>
<ul>
<li><a href="#sec-2-1">2.1 步骤</a></li>
<li><a href="#sec-2-2">2.2 例子</a></li>
</ul>
</li>
<li><a href="#sec-3">3 二叉树非递归遍历</a>
<ul>
<li><a href="#sec-3-1">3.1 参考内容</a></li>
</ul>
</li>
<li><a href="#sec-4">4 参考内容</a>
<ul>
<li><a href="#sec-4-1">4.1 http://bbs.bccn.net/thread-175695-1-1.html</a></li>
<li><a href="#sec-4-2">4.2 http://zh.wikipedia.org/zh-cn/尾部递归</a></li>
<li><a href="#sec-4-3">4.3 http://blog.zhaojie.me/2009/03/tail-recursion-and-continuation.html</a></li>
<li><a href="#sec-4-4">4.4 http://bbs.chinaunix.net/forum.php?mod=viewthread&amp;tid=331522</a></li>
<li><a href="#sec-4-5">4.5 http://mingliangfeng.iteye.com/blog/201084</a></li>
</ul>
</li>
<li><a href="#sec-5">5 参考资料</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 流氓做法直接将递归式改为for循环</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 步骤</h3>
<div class="outline-text-3" id="text-1-1">

<ol>
<li>将函数表示为result，边界条件的返回值就是result的初值
</li>
<li>边界条件稍作改动成为for循环的判断条件
</li>
<li>界函数作为for循环的变量改变部分
</li>
<li>循环体内就是递归式
</li>
<li>返回result
</li>
</ol>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 例子1</h3>
<div class="outline-text-3" id="text-1-2">




<pre class="src src-C"><span style="color: #ad7fa8;">int</span> <span style="color: #c4a000;">f_recursive</span>(<span style="color: #ad7fa8;">int</span> m, <span style="color: #ad7fa8;">int</span> n)
{
    <span style="color: #729fcf;">if</span> (m == 0 &amp;&amp; n &gt;= 0) 
        <span style="color: #729fcf;">return</span> 0;
    <span style="color: #729fcf;">return</span> (f_recursive(m - 1, 2*n) + n);
}
</pre>


<pre class="src src-C"><span style="color: #ad7fa8;">int</span> <span style="color: #c4a000;">f_no_recursive</span>(<span style="color: #ad7fa8;">int</span> m, <span style="color: #ad7fa8;">int</span> n)
{
    <span style="color: #ad7fa8;">int</span> result = 0;
    <span style="color: #729fcf;">for</span> (; m != 0 &amp;&amp; n &gt;= 0; --m, n *= 2)
    {
        result += n;
    }
    <span style="color: #729fcf;">return</span> result;
}
</pre>

</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 例子2</h3>
<div class="outline-text-3" id="text-1-3">




<pre class="src src-C"><span style="color: #ad7fa8;">int</span> <span style="color: #c4a000;">f_recursive</span>(<span style="color: #ad7fa8;">int</span> n)
{
    <span style="color: #729fcf;">if</span> (n == 0) 
        <span style="color: #729fcf;">return</span> 1;
    <span style="color: #729fcf;">return</span> (n * f_recursive(n/2));
}
</pre>


<pre class="src src-C"><span style="color: #ad7fa8;">int</span> <span style="color: #c4a000;">f_no_recursive</span>(<span style="color: #ad7fa8;">int</span> n)
{
    <span style="color: #ad7fa8;">int</span> result = 1;
    <span style="color: #729fcf;">for</span> (; n != 0; n /= 2)
    {
        result *= n;
    }
    <span style="color: #729fcf;">return</span> result;
}
</pre>


</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 例子3</h3>
<div class="outline-text-3" id="text-1-4">




<pre class="src src-C"><span style="color: #ad7fa8;">int</span> <span style="color: #c4a000;">factorial_recursive</span>(<span style="color: #ad7fa8;">int</span> n)
{
    <span style="color: #729fcf;">if</span> (n == 0)    <span style="color: #61635e;">//</span><span style="color: #6A6F63;">&#36793;&#30028;&#26465;&#20214;</span>
    {
        <span style="color: #729fcf;">return</span> 1;
    }
    <span style="color: #729fcf;">return</span> factorial_recursive(n-1<span style="color: #61635e;">/*</span><span style="color: #6A6F63;">&#30028;&#20989;&#25968;</span><span style="color: #61635e;">*/</span>) * n;    <span style="color: #61635e;">//</span><span style="color: #6A6F63;">f*n&#26159;&#36882;&#24402;&#24335;</span>
}
</pre>


<pre class="src src-C"><span style="color: #ad7fa8;">int</span> <span style="color: #c4a000;">factorial_no_recursive</span>(<span style="color: #ad7fa8;">int</span> n)
{
    <span style="color: #ad7fa8;">int</span> result = 1;
    <span style="color: #729fcf;">for</span> (; n != 0; --n)
    {
        result *= n;
    }
    <span style="color: #729fcf;">return</span> result;
}
</pre>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 递归转尾递归转循环</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 步骤</h3>
<div class="outline-text-3" id="text-2-1">

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 例子</h3>
<div class="outline-text-3" id="text-2-2">

<ul>
<li id="sec-2-2-1">Factorial<br/>



<pre class="src src-C"><span style="color: #ad7fa8;">int</span> <span style="color: #c4a000;">factorial_recursive</span>(<span style="color: #ad7fa8;">int</span> n)
{
    <span style="color: #729fcf;">if</span> (n == 0)    <span style="color: #61635e;">//</span><span style="color: #6A6F63;">&#36793;&#30028;&#26465;&#20214;</span>
    {
        <span style="color: #729fcf;">return</span> 1;
    }
    <span style="color: #729fcf;">return</span> factorial_recursive(n-1<span style="color: #61635e;">/*</span><span style="color: #6A6F63;">&#30028;&#20989;&#25968;</span><span style="color: #61635e;">*/</span>) * n;    <span style="color: #61635e;">//</span><span style="color: #6A6F63;">f*n&#26159;&#36882;&#24402;&#24335;</span>
}
</pre>



<pre class="src src-C"><span style="color: #ad7fa8;">int</span> <span style="color: #c4a000;">factorial_tail_recursive</span>(<span style="color: #ad7fa8;">int</span> n, <span style="color: #ad7fa8;">int</span> acc)    <span style="color: #61635e;">//</span><span style="color: #6A6F63;">&#29992;acc&#34920;&#31034;f&#30340;&#36820;&#22238;&#32467;&#26524;</span>
{
    <span style="color: #729fcf;">if</span> (n == 0)
    {
        <span style="color: #729fcf;">return</span> acc;
    }
    <span style="color: #729fcf;">return</span> factorial_tail_recursive(n-1<span style="color: #61635e;">/*</span><span style="color: #6A6F63;">&#30028;&#20989;&#25968;</span><span style="color: #61635e;">*/</span>, acc*n);    <span style="color: #61635e;">//</span><span style="color: #6A6F63;">acc*n &#36882;&#24402;&#24335;</span>
}
</pre>



<pre class="src src-C"><span style="color: #ad7fa8;">int</span> <span style="color: #c4a000;">factorial_loop</span>(<span style="color: #ad7fa8;">int</span> n, <span style="color: #ad7fa8;">int</span> acc)
{
    <span style="color: #729fcf;">while</span> (<span style="color: #4e9a06;">true</span>)
    {
        <span style="color: #729fcf;">if</span> (n == 0)
        {
            <span style="color: #729fcf;">return</span> acc;
        }
        acc *= n;
        --n;
    }
}
</pre>


</li>
</ul>
<ul>
<li id="sec-2-2-2">Fibonacci<br/>



<pre class="src src-C"><span style="color: #ad7fa8;">int</span> <span style="color: #c4a000;">fibonacci_recursive</span>(<span style="color: #ad7fa8;">int</span> n)
{
    <span style="color: #729fcf;">if</span> (n &lt; 2)    <span style="color: #61635e;">//</span><span style="color: #6A6F63;">&#36882;&#24402;&#20986;&#21475;</span>
    {
        <span style="color: #729fcf;">return</span> n;
    }
    <span style="color: #729fcf;">return</span> fibonacci_recursive(n-1) + fibonacci_recursive(n-2);
}
</pre>



<pre class="src src-C"><span style="color: #ad7fa8;">int</span> <span style="color: #c4a000;">fibonacci_tail_recursive</span>(<span style="color: #ad7fa8;">int</span> n, <span style="color: #ad7fa8;">int</span> acc1, <span style="color: #ad7fa8;">int</span> acc2)
{
    <span style="color: #729fcf;">if</span> (n == 0)
    {
        <span style="color: #729fcf;">return</span> acc1;
    }
    <span style="color: #729fcf;">return</span> fibonacci_tail_recursive(n-1, acc2, acc1+acc2);
}
</pre>



<pre class="src src-C"><span style="color: #ad7fa8;">int</span> <span style="color: #c4a000;">fibonacci_loop</span>(<span style="color: #ad7fa8;">int</span> n, <span style="color: #ad7fa8;">int</span> acc1, <span style="color: #ad7fa8;">int</span> acc2)
{
    <span style="color: #729fcf;">while</span> (<span style="color: #4e9a06;">true</span>)
    {
        <span style="color: #729fcf;">if</span> (n == 0)
        {
            <span style="color: #729fcf;">return</span> acc1;
        }
        <span style="color: #ad7fa8;">int</span> temp = acc1;
        acc1 = acc2;
        acc2 = temp + acc2;
        --n;
    }
}
</pre>

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 二叉树非递归遍历</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 参考内容</h3>
<div class="outline-text-3" id="text-3-1">

<ul>
<li id="sec-3-1-1"><a href="http://www.cnblogs.com/dolphin0520/archive/2011/08/25/2153720.html">http://www.cnblogs.com/dolphin0520/archive/2011/08/25/2153720.html</a><br/>
<ul>
<li id="sec-3-1-1-1">前序非递归<br/>
