流氓做法将递归式改为for循环/流氓做法将递归式改为for循环.org
**** 前序非递归
根据前序遍历访问的顺序，优先访问根结点，然后再分别访问左孩子和右孩子。
即对于任一结点，其可看做是根结点，因此可以直接访问，访问完之后，若其左孩子不为空，按相同规则访问它的左子树；
当访问完左子树时，再访问它的右子树。因此其处理过程如下：
     对于任一结点P：
     1) 访问结点P，并将结点P入栈;
     2) 判断结点P的左孩子是否为空，若为空，则取栈顶结点并进行出栈操作，并将栈顶结点的右孩子置为当前的结点P，循环至1);
                              若不为空，则将P的左孩子置为当前的结点P;
     3) 直到P为NULL并且栈为空，则遍历结束。
#+begin_src c++
template <typename T, typename VisitFun>    //貌似这个版本正规些
void pre_order_visit_no_recursive2(TreeNode<T>* p_tree, VisitFun visitFun)
{
    stack<TreeNode<T>*> node_stack;

    while (p_tree != NULL || !node_stack.empty())    //直到p_tree为NULL并且栈为空，则遍历结束
    {
	while (p_tree != NULL)
	{
	    visitFun(p_tree->value);    //访问结点p_tree，
	    node_stack.push(p_tree);    //并将结点p_tree入栈;
	    p_tree = p_tree->left;      //若不为空，则将p_tree的左孩子置为当前的结点p_tree
	}
	if (!node_stack.empty())
	{
	    p_tree = node_stack.top();    //判断结点p_tree的左孩子是否为空，若为空，则取栈顶结点
 	    node_stack.pop();             //并进行出栈操作，
	    p_tree = p_tree->right;       //并将栈顶结点的右孩子置为当前的结点p_tree，循环至1)
	}
    }
}

#+end_src
**** 中序非递归
根据中序遍历的顺序，对于任一结点，优先访问其左孩子，
而左孩子结点又可以看做一根结点，然后继续访问其左孩子结点， *直到遇到左孩子结点为空的结点才进行访问* ，
然后按相同的规则访问其右子树。因此其处理过程如下：
   对于任一结点P：
  1) 若其左孩子不为空，则将P入栈并将P的左孩子置为当前的P，然后对当前结点P再进行相同的处理；
  2) 若其左孩子为空，则取栈顶元素并进行出栈操作，访问该栈顶结点，然后将当前的P置为栈顶结点的右孩子；
  3) 直到P为NULL并且栈为空则遍历结束
#+begin_src c++
template <typename T, typename VisitFun>
void in_order_visit_no_recursive(TreeNode<T>* p_tree, VisitFun visitFun)
{
    stack<TreeNode<T>*> node_stack;
    while (p_tree != NULL || !node_stack.empty())    //直到p_tree为NULL并且栈为空则遍历结束
    {
	while (p_tree != NULL)
	{
	    node_stack.push(p_tree);    //若其左孩子不为空，则将p_tree入栈
	    p_tree = p_tree->left;      //并将p_tree的左孩子置为当前的p_tree，然后对当前结点p_tree再进行相同的处理
	}
	if (!node_stack.empty())
	{
	    p_tree = node_stack.top();    //若其左孩子为空，则取栈顶元素并进行出栈操作，
	    node_stack.pop();
	    visitFun(p_tree->value);      //访问该栈顶结点，
	    p_tree = p_tree->right;       //然后将当前的p_tree置为栈顶结点的右孩子
	}
    }
}

#+end_src
**** 后续非递归

***** 第一种思路
对于任一结点P，将其入栈，然后沿其左子树一直往下搜索，直到搜索到没有左孩子的结点，此时该结点出现在栈顶，但是此时不能将其出栈并访问，因为其右孩子还未被访问。
所以接下来按照相同的规则对其右子树进行相同的处理，当访问完其右孩子时，该结点又出现在栈顶，此时可以将其出栈并访问。这样就保证了正确的访问顺序。
可以看出，在这个过程中，每个结点都两次出现在栈顶，只有在第二次出现在栈顶时，才能访问它。
因此需要多设置一个变量标识该结点是否是第一次出现在栈顶。 
#+begin_src c++
template <typename T, typename VisitFun>
void post_order_visit_no_recursive(TreeNode<T>* p_tree, VisitFun visitFun)
{
    stack<TreeNode<T>*> node_stack;
    while (p_tree != NULL || !node_stack.empty())
    {
	while (p_tree != NULL)
	{
	    p_tree->isFirst = true;
	    node_stack.push(p_tree);
	    p_tree = p_tree->left;
	}
	if (!node_stack.empty())
	{
	    p_tree = node_stack.top();
	    node_stack.pop();
	    if (p_tree->isFirst == true)
	    {
		p_tree->isFirst = false;
		node_stack.push(p_tree);
		p_tree = p_tree->right;
	    }
	    else
	    {
		visitFun(p_tree->value);
		p_tree = NULL;
	    }
	}
    }
}

#+end_src
***** 第二种思路
要保证根结点在左孩子和右孩子访问之后才能访问，因此对于任一结点P，先将其入栈。
如果P不存在左孩子和右孩子，则可以直接访问它；或者P存在左孩子或者右孩子，但是其左孩子和右孩子都已被访问过了，则同样可以直接访问该结点。
若非上述两种情况，则将P的右孩子和左孩子依次入栈，这样就保证了每次取栈顶元素的时候，左孩子在右孩子前面被访问，左孩子和右孩子都在根结点前面被访问。
#+begin_src c++
template <typename T, typename VisitFun>
void post_order_visit_no_recursive2(TreeNode<T>* p_tree, VisitFun visitFun)    //有BUG，少最左边的叶子节点？
{
    stack<TreeNode<T>*> node_stack;
    node_stack.push(p_tree);
    TreeNode<T>* p_previous = NULL;
    TreeNode<T>* p_current;

    while (!node_stack.empty())
    {
	p_current = node_stack.top();
	if ((p_current->left == NULL && p_current->right == NULL) || (p_current != NULL && (p_previous == p_current->left || p_previous == p_current->right)))    //如果当前结点没有孩子结点或者孩子节点都已被访问过
	{
	    visitFun(p_current->value);
	    node_stack.pop();
	    p_previous = p_current;
	}
	else
	{
	    if (p_current->right != NULL)
	    {
		node_stack.push(p_current->right);
	    }
	    if (p_current->left != NULL)
	    {
		node_stack.push(p_current->left);
	    }
	}
    }
}

#+end_src
* 参考内容
