流氓做法将递归式改为for循环/流氓做法将递归式改为for循环.html
根据前序遍历访问的顺序，优先访问根结点，然后再分别访问左孩子和右孩子。
即对于任一结点，其可看做是根结点，因此可以直接访问，访问完之后，若其左孩子不为空，按相同规则访问它的左子树；
当访问完左子树时，再访问它的右子树。因此其处理过程如下：
     对于任一结点P：
<ol>
<li>访问结点P，并将结点P入栈;
</li>
<li>判断结点P的左孩子是否为空，若为空，则取栈顶结点并进行出栈操作，并将栈顶结点的右孩子置为当前的结点P，循环至1);
                              若不为空，则将P的左孩子置为当前的结点P;
</li>
<li>直到P为NULL并且栈为空，则遍历结束。
</li>
</ol>




<pre class="src src-c++"><span style="color: #729fcf;">template</span> &lt;<span style="color: #729fcf;">typename</span> <span style="color: #ad7fa8;">T</span>, <span style="color: #729fcf;">typename</span> <span style="color: #ad7fa8;">VisitFun</span>&gt;    <span style="color: #61635e;">//</span><span style="color: #6A6F63;">&#35980;&#20284;&#36825;&#20010;&#29256;&#26412;&#27491;&#35268;&#20123;</span>
<span style="color: #ad7fa8;">void</span> <span style="color: #c4a000;">pre_order_visit_no_recursive2</span>(<span style="color: #ad7fa8;">TreeNode</span>&lt;<span style="color: #ad7fa8;">T</span>&gt;* p_tree, <span style="color: #ad7fa8;">VisitFun</span> visitFun)
{
    <span style="color: #ad7fa8;">stack</span>&lt;<span style="color: #ad7fa8;">TreeNode</span>&lt;<span style="color: #ad7fa8;">T</span>&gt;*&gt; node_stack;

    <span style="color: #729fcf;">while</span> (p_tree != <span style="color: #4e9a06;">NULL</span> || !node_stack.empty())    <span style="color: #61635e;">//</span><span style="color: #6A6F63;">&#30452;&#21040;p_tree&#20026;NULL&#24182;&#19988;&#26632;&#20026;&#31354;&#65292;&#21017;&#36941;&#21382;&#32467;&#26463;</span>
    {
        <span style="color: #729fcf;">while</span> (p_tree != <span style="color: #4e9a06;">NULL</span>)
        {
            visitFun(p_tree-&gt;value);    <span style="color: #61635e;">//</span><span style="color: #6A6F63;">&#35775;&#38382;&#32467;&#28857;p_tree&#65292;</span>
            node_stack.push(p_tree);    <span style="color: #61635e;">//</span><span style="color: #6A6F63;">&#24182;&#23558;&#32467;&#28857;p_tree&#20837;&#26632;;</span>
            p_tree = p_tree-&gt;left;      <span style="color: #61635e;">//</span><span style="color: #6A6F63;">&#33509;&#19981;&#20026;&#31354;&#65292;&#21017;&#23558;p_tree&#30340;&#24038;&#23401;&#23376;&#32622;&#20026;&#24403;&#21069;&#30340;&#32467;&#28857;p_tree</span>
        }
        <span style="color: #729fcf;">if</span> (!node_stack.empty())
        {
            p_tree = node_stack.top();    <span style="color: #61635e;">//</span><span style="color: #6A6F63;">&#21028;&#26029;&#32467;&#28857;p_tree&#30340;&#24038;&#23401;&#23376;&#26159;&#21542;&#20026;&#31354;&#65292;&#33509;&#20026;&#31354;&#65292;&#21017;&#21462;&#26632;&#39030;&#32467;&#28857;</span>
            node_stack.pop();             <span style="color: #61635e;">//</span><span style="color: #6A6F63;">&#24182;&#36827;&#34892;&#20986;&#26632;&#25805;&#20316;&#65292;</span>
            p_tree = p_tree-&gt;right;       <span style="color: #61635e;">//</span><span style="color: #6A6F63;">&#24182;&#23558;&#26632;&#39030;&#32467;&#28857;&#30340;&#21491;&#23401;&#23376;&#32622;&#20026;&#24403;&#21069;&#30340;&#32467;&#28857;p_tree&#65292;&#24490;&#29615;&#33267;1)</span>
        }
    }
}

</pre>

</li>
</ul>
<ul>
<li id="sec-3-1-1-2">中序非递归<br/>
根据中序遍历的顺序，对于任一结点，优先访问其左孩子，
而左孩子结点又可以看做一根结点，然后继续访问其左孩子结点， <b>直到遇到左孩子结点为空的结点才进行访问</b> ，
然后按相同的规则访问其右子树。因此其处理过程如下：
   对于任一结点P：
<ol>
<li>若其左孩子不为空，则将P入栈并将P的左孩子置为当前的P，然后对当前结点P再进行相同的处理；
</li>
<li>若其左孩子为空，则取栈顶元素并进行出栈操作，访问该栈顶结点，然后将当前的P置为栈顶结点的右孩子；
</li>
<li>直到P为NULL并且栈为空则遍历结束
</li>
</ol>




<pre class="src src-c++"><span style="color: #729fcf;">template</span> &lt;<span style="color: #729fcf;">typename</span> <span style="color: #ad7fa8;">T</span>, <span style="color: #729fcf;">typename</span> <span style="color: #ad7fa8;">VisitFun</span>&gt;
<span style="color: #ad7fa8;">void</span> <span style="color: #c4a000;">in_order_visit_no_recursive</span>(<span style="color: #ad7fa8;">TreeNode</span>&lt;<span style="color: #ad7fa8;">T</span>&gt;* p_tree, <span style="color: #ad7fa8;">VisitFun</span> visitFun)
{
    <span style="color: #ad7fa8;">stack</span>&lt;<span style="color: #ad7fa8;">TreeNode</span>&lt;<span style="color: #ad7fa8;">T</span>&gt;*&gt; node_stack;
    <span style="color: #729fcf;">while</span> (p_tree != <span style="color: #4e9a06;">NULL</span> || !node_stack.empty())    <span style="color: #61635e;">//</span><span style="color: #6A6F63;">&#30452;&#21040;p_tree&#20026;NULL&#24182;&#19988;&#26632;&#20026;&#31354;&#21017;&#36941;&#21382;&#32467;&#26463;</span>
    {
        <span style="color: #729fcf;">while</span> (p_tree != <span style="color: #4e9a06;">NULL</span>)
        {
            node_stack.push(p_tree);    <span style="color: #61635e;">//</span><span style="color: #6A6F63;">&#33509;&#20854;&#24038;&#23401;&#23376;&#19981;&#20026;&#31354;&#65292;&#21017;&#23558;p_tree&#20837;&#26632;</span>
            p_tree = p_tree-&gt;left;      <span style="color: #61635e;">//</span><span style="color: #6A6F63;">&#24182;&#23558;p_tree&#30340;&#24038;&#23401;&#23376;&#32622;&#20026;&#24403;&#21069;&#30340;p_tree&#65292;&#28982;&#21518;&#23545;&#24403;&#21069;&#32467;&#28857;p_tree&#20877;&#36827;&#34892;&#30456;&#21516;&#30340;&#22788;&#29702;</span>
        }
        <span style="color: #729fcf;">if</span> (!node_stack.empty())
        {
            p_tree = node_stack.top();    <span style="color: #61635e;">//</span><span style="color: #6A6F63;">&#33509;&#20854;&#24038;&#23401;&#23376;&#20026;&#31354;&#65292;&#21017;&#21462;&#26632;&#39030;&#20803;&#32032;&#24182;&#36827;&#34892;&#20986;&#26632;&#25805;&#20316;&#65292;</span>
            node_stack.pop();
            visitFun(p_tree-&gt;value);      <span style="color: #61635e;">//</span><span style="color: #6A6F63;">&#35775;&#38382;&#35813;&#26632;&#39030;&#32467;&#28857;&#65292;</span>
            p_tree = p_tree-&gt;right;       <span style="color: #61635e;">//</span><span style="color: #6A6F63;">&#28982;&#21518;&#23558;&#24403;&#21069;&#30340;p_tree&#32622;&#20026;&#26632;&#39030;&#32467;&#28857;&#30340;&#21491;&#23401;&#23376;</span>
        }
    }
}

</pre>

</li>
</ul>
<ul>
<li id="sec-3-1-1-3">后续非递归<br/>

<ul>
<li id="sec-3-1-1-3-1">第一种思路<br/>
对于任一结点P，将其入栈，然后沿其左子树一直往下搜索，直到搜索到没有左孩子的结点，此时该结点出现在栈顶，但是此时不能将其出栈并访问，因为其右孩子还未被访问。
所以接下来按照相同的规则对其右子树进行相同的处理，当访问完其右孩子时，该结点又出现在栈顶，此时可以将其出栈并访问。这样就保证了正确的访问顺序。
可以看出，在这个过程中，每个结点都两次出现在栈顶，只有在第二次出现在栈顶时，才能访问它。
因此需要多设置一个变量标识该结点是否是第一次出现在栈顶。 



<pre class="src src-c++"><span style="color: #729fcf;">template</span> &lt;<span style="color: #729fcf;">typename</span> <span style="color: #ad7fa8;">T</span>, <span style="color: #729fcf;">typename</span> <span style="color: #ad7fa8;">VisitFun</span>&gt;
<span style="color: #ad7fa8;">void</span> <span style="color: #c4a000;">post_order_visit_no_recursive</span>(<span style="color: #ad7fa8;">TreeNode</span>&lt;<span style="color: #ad7fa8;">T</span>&gt;* p_tree, <span style="color: #ad7fa8;">VisitFun</span> visitFun)
{
    <span style="color: #ad7fa8;">stack</span>&lt;<span style="color: #ad7fa8;">TreeNode</span>&lt;<span style="color: #ad7fa8;">T</span>&gt;*&gt; node_stack;
    <span style="color: #729fcf;">while</span> (p_tree != <span style="color: #4e9a06;">NULL</span> || !node_stack.empty())
    {
        <span style="color: #729fcf;">while</span> (p_tree != <span style="color: #4e9a06;">NULL</span>)
        {
            p_tree-&gt;isFirst = <span style="color: #4e9a06;">true</span>;
            node_stack.push(p_tree);
            p_tree = p_tree-&gt;left;
        }
        <span style="color: #729fcf;">if</span> (!node_stack.empty())
        {
            p_tree = node_stack.top();
            node_stack.pop();
            <span style="color: #729fcf;">if</span> (p_tree-&gt;isFirst == <span style="color: #4e9a06;">true</span>)
            {
                p_tree-&gt;isFirst = <span style="color: #4e9a06;">false</span>;
                node_stack.push(p_tree);
                p_tree = p_tree-&gt;right;
            }
            <span style="color: #729fcf;">else</span>
            {
                visitFun(p_tree-&gt;value);
                p_tree = <span style="color: #4e9a06;">NULL</span>;
            }
        }
    }
}

</pre>

</li>
</ul>
<ul>
<li id="sec-3-1-1-3-2">第二种思路<br/>
要保证根结点在左孩子和右孩子访问之后才能访问，因此对于任一结点P，先将其入栈。
如果P不存在左孩子和右孩子，则可以直接访问它；或者P存在左孩子或者右孩子，但是其左孩子和右孩子都已被访问过了，则同样可以直接访问该结点。
若非上述两种情况，则将P的右孩子和左孩子依次入栈，这样就保证了每次取栈顶元素的时候，左孩子在右孩子前面被访问，左孩子和右孩子都在根结点前面被访问。



<pre class="src src-c++"><span style="color: #729fcf;">template</span> &lt;<span style="color: #729fcf;">typename</span> <span style="color: #ad7fa8;">T</span>, <span style="color: #729fcf;">typename</span> <span style="color: #ad7fa8;">VisitFun</span>&gt;
<span style="color: #ad7fa8;">void</span> <span style="color: #c4a000;">post_order_visit_no_recursive2</span>(<span style="color: #ad7fa8;">TreeNode</span>&lt;<span style="color: #ad7fa8;">T</span>&gt;* p_tree, <span style="color: #ad7fa8;">VisitFun</span> visitFun)    <span style="color: #61635e;">//</span><span style="color: #6A6F63;">&#26377;BUG&#65292;&#23569;&#26368;&#24038;&#36793;&#30340;&#21494;&#23376;&#33410;&#28857;&#65311;</span>
{
    <span style="color: #ad7fa8;">stack</span>&lt;<span style="color: #ad7fa8;">TreeNode</span>&lt;<span style="color: #ad7fa8;">T</span>&gt;*&gt; node_stack;
    node_stack.push(p_tree);
    <span style="color: #ad7fa8;">TreeNode</span>&lt;<span style="color: #ad7fa8;">T</span>&gt;* p_previous = <span style="color: #4e9a06;">NULL</span>;
    <span style="color: #ad7fa8;">TreeNode</span>&lt;<span style="color: #ad7fa8;">T</span>&gt;* p_current;

    <span style="color: #729fcf;">while</span> (!node_stack.empty())
    {
        p_current = node_stack.top();
        <span style="color: #729fcf;">if</span> ((p_current-&gt;left == <span style="color: #4e9a06;">NULL</span> &amp;&amp; p_current-&gt;right == <span style="color: #4e9a06;">NULL</span>) || (p_current != <span style="color: #4e9a06;">NULL</span> &amp;&amp; (p_previous == p_current-&gt;left || p_previous == p_current-&gt;right)))    <span style="color: #61635e;">//</span><span style="color: #6A6F63;">&#22914;&#26524;&#24403;&#21069;&#32467;&#28857;&#27809;&#26377;&#23401;&#23376;&#32467;&#28857;&#25110;&#32773;&#23401;&#23376;&#33410;&#28857;&#37117;&#24050;&#34987;&#35775;&#38382;&#36807;</span>
        {
            visitFun(p_current-&gt;value);
            node_stack.pop();
            p_previous = p_current;
        }
        <span style="color: #729fcf;">else</span>
        {
            <span style="color: #729fcf;">if</span> (p_current-&gt;right != <span style="color: #4e9a06;">NULL</span>)
            {
                node_stack.push(p_current-&gt;right);
            }
            <span style="color: #729fcf;">if</span> (p_current-&gt;left != <span style="color: #4e9a06;">NULL</span>)
            {
                node_stack.push(p_current-&gt;left);
            }
        }
    }
}

</pre>

</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

</div>
