流氓做法将递归式改为for循环/流氓做法将递归式改为for循环.html

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 参考内容</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> <a href="http://bbs.bccn.net/thread-175695-1-1.html">http://bbs.bccn.net/thread-175695-1-1.html</a></h3>
<div class="outline-text-3" id="text-4-1">

<p>一般根据是否需要回朔可以把递归分成简单递归和复杂递归
简单递归一般就是根据递归式来找出递推公式（这也就引申出分治思想和动态规划）
复杂递归一般就是模拟系统处理递归的机制，使用栈或队列等数据结构保存回朔点来求解
</p>
<p>
递归的几个 <b>特点</b>
</p><ol>
<li>递归式，就是如何将原问题划分成子问题。
</li>
<li>递归出口，递归终止的条件，即 <b>最小子问题的求解</b> ，可以允许多个出口。
</li>
<li>界函数，问题规模变化的函数，它保证递归的规模向出口条件靠拢
</li>
</ol>


</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> <a href="http://zh.wikipedia.org/zh-cn/尾部递归">http://zh.wikipedia.org/zh-cn/尾部递归</a></h3>
<div class="outline-text-3" id="text-4-2">

<p>尾递归：如果在递归函数中，递归调用返回的结果总被直接返回，则称为尾部递归
</p>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> <a href="http://blog.zhaojie.me/2009/03/tail-recursion-and-continuation.html">http://blog.zhaojie.me/2009/03/tail-recursion-and-continuation.html</a></h3>
<div class="outline-text-3" id="text-4-3">

<p>与普通递归相比，由于尾递归的调用处于方法的最后，因此方法之前所积累下的各种状态对于递归调用结果已经没有任何意义，因此完全可以把本次方法中留在堆栈中的数据完全清除，把空间让给最后的递归调用。
这样的优化便使得递归不会在调用堆栈上产生堆积，意味着即时是“无限”递归也不会让堆栈溢出。这便是尾递归的 <b>优势</b> 。
尾递归的 <b>本质</b> ，其实是将递归方法中的需要的“所有状态”通过方法的参数传入下一次调用中
</p>
</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> <a href="http://bbs.chinaunix.net/forum.php?mod=viewthread&amp;tid=331522">http://bbs.chinaunix.net/forum.php?mod=viewthread&amp;tid=331522</a></h3>
<div class="outline-text-3" id="text-4-4">

<p>递归调用时数据都是保存在栈中的,有多少个数据需要保存就要设置多少个栈,
而且最重要的一点是:控制所有这些栈的栈顶指针都是相同的,否则无法实现同步
</p>
<p>
树的三种遍历方式,抽象出来只有三种操作:访问当前结点,访问左子树,访问右子树.这三种操作的顺序不同,遍历方式也不同.如果我们再抽象一点,对这三种操作再进行一个概括,可以得到:
a)访问当前结点:对目前的数据进行一些处理;
b)访问左子树: <b>变换当前的数据</b> 以进行下一次处理;
c)访问右子树: <b>再次变换</b> 当前的数据以进行下一次处理(与访问左子树所不同的方式).
</p>
<p>
如何确定转移到哪里继续执行?关键在于以下三个地方:
a)确定对当前数据的访问顺序,简单一点说就是确定这个递归程序 <span style="text-decoration:underline;">可以转换为哪种方式遍历的树结构</span>;
b)确定这个递归函数转换为递归调用树时的分支是如何划分的,即确定 <span style="text-decoration:underline;">什么是这个递归调用树的"左子树"和"右子树</span>"
c)确定这个递归调用树何时返回,即确定什么结点是这个递归调用树的 <b>叶子结点</b>.
</p>
<p>
非尾部递归,在一个选择分支中有至少一个的递归调用.
相对而言,尾部递归就容易很多了,因为与非尾部递归相比,每个选择分支只有一个递归调用,
我们在解决的时候就不需要使用到栈,只要循环和设置好循环体就可以了
</p>
</div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> <a href="http://mingliangfeng.iteye.com/blog/201084">http://mingliangfeng.iteye.com/blog/201084</a></h3>
<div class="outline-text-3" id="text-4-5">

<p>递归程序转换成非递归程序时有固定的模式可循，将这个模式抽象成通用的模板，就有可能实现递归至非递归程序的自动转换。
根据前面的分析，将递归计算用树型结构来表达，计算父节点时，会要求计算出其子节点的值。
如果用一个堆栈来表示，则计算父节点时，会先将该父节点压入堆栈，待到其依赖的所有子节点的值都计算出时，再将其弹出并计算其值；
在计算其子节点时依照相同的原理，直至遇到叶子节点。
</p></div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 参考资料</h2>
<div class="outline-text-2" id="text-5">

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-09-21 08:48:49 中国标准时间</p>
<p class="author">Author: wyj</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
